nc: 80  # number of classes

scales:
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]

# =========================
# Backbone (FDDM)
# =========================
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]          # 0 - P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1 - P2/4
  - [-1, 3, C2f, [128, True]]          # 2
  - [-1, 1, Conv, [256, 3, 2]]         # 3 - P3/8
  - [-1, 6, C2f, [256, True]]          # 4  ← P3
  - [-1, 1, SCDown, [512, 3, 2]]       # 5 - P4/16
  - [-1, 1, LMWEM, [512]]               # 6
  - [-1, 6, C2f, [512, True]]          # 7  ← P4
  - [-1, 1, LMWEM, [512]]               # 8
  - [-1, 1, SCDown, [1024, 3, 2]]      # 9 - P5/32
  - [-1, 3, C2f, [1024, True]]         # 10
  - [-1, 1, SPPF, [1024, 5]]           # 11
  - [-1, 1, PSA, [1024]]               # 12  ← P5


# =========================
# Head (ACFM)
# =========================
head:
  # -------- P4 ↔ P5 --------
  - [[7, 12], 1, CSDKM, [256, 3, 4, 7, 2, "cosin"]]   # 13
  - [-1, 3, C2f, [512]]                            # 14  ← P4'

  # -------- P3 ↔ P4 --------
  - [[4, 14], 1, CSDKM, [128, 3, 4, 7, 2, "cosin"]]   # 15
  - [-1, 3, C2f, [256]]                            # 16  ← P3'

  # -------- P3 ↔ P4 (refine) --------
  - [[14, 16], 1, CSDKM, [256, 3, 4, 7, 2, "cosin"]]  # 17
  - [-1, 3, C2f, [512]]                            # 18  ← P4''

  # -------- P4 ↔ P5 (refine) --------
  - [[12, 18], 1, CSDKM, [512, 3, 4, 7, 2, "cosin"]]  # 19
  - [-1, 3, C2fCIB, [1024, True, True]]            # 20  ← P5'

  # -------- Detect --------
  - [[16, 18, 20], 1, v10Detect, [nc]]             # Detect(P3, P4, P5)
